### Terraform plan (prod) — completed

<details><summary>Show plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.archive_file.codebase will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "codebase" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./../../dist"
      + type                = "zip"
    }

  # aws_api_gateway_authorizer.this will be created
  + resource "aws_api_gateway_authorizer" "this" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "CognitoUserPoolAuthorizer"
      + provider_arns                    = (known after apply)
      + region                           = "sa-east-1"
      + rest_api_id                      = (known after apply)
      + type                             = "COGNITO_USER_POOLS"
    }

  # aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "sa-east-1"
      + rest_api_id  = (known after apply)
      + triggers     = (known after apply)
    }

  # aws_api_gateway_gateway_response.cors_4xx will be created
  + resource "aws_api_gateway_gateway_response" "cors_4xx" {
      + id                  = (known after apply)
      + region              = "sa-east-1"
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'false'"
          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"      = "'*'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # aws_api_gateway_gateway_response.cors_5xx will be created
  + resource "aws_api_gateway_gateway_response" "cors_5xx" {
      + id                  = (known after apply)
      + region              = "sa-east-1"
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'false'"
          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"      = "'*'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_5XX"
      + rest_api_id         = (known after apply)
    }

  # aws_api_gateway_integration.cors will be created
  + resource "aws_api_gateway_integration" "cors" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "sa-east-1"
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # aws_api_gateway_integration.cors_todo will be created
  + resource "aws_api_gateway_integration" "cors_todo" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "sa-east-1"
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # aws_api_gateway_integration.todo will be created
  + resource "aws_api_gateway_integration" "todo" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "sa-east-1"
      + request_parameters      = {
          + "integration.request.path.todoId" = "method.request.path.todoId"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.todos will be created
  + resource "aws_api_gateway_integration" "todos" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "sa-east-1"
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration_response.cors will be created
  + resource "aws_api_gateway_integration_response" "cors" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "sa-east-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Credentials" = "'false'"
          + "method.response.header.Access-Control-Allow-Headers"     = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods"     = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"      = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # aws_api_gateway_integration_response.cors_todo will be created
  + resource "aws_api_gateway_integration_response" "cors_todo" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "sa-east-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Credentials" = "'false'"
          + "method.response.header.Access-Control-Allow-Headers"     = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods"     = "'DELETE,GET,HEAD,OPTIONS,PATCH,POST,PUT'"
          + "method.response.header.Access-Control-Allow-Origin"      = "'*'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # aws_api_gateway_method.cors will be created
  + resource "aws_api_gateway_method" "cors" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "sa-east-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method.cors_todo will be created
  + resource "aws_api_gateway_method" "cors_todo" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "sa-east-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method.todo will be created
  + resource "aws_api_gateway_method" "todo" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "ANY"
      + id                 = (known after apply)
      + region             = "sa-east-1"
      + request_parameters = {
          + "method.request.path.todoId" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method.todos will be created
  + resource "aws_api_gateway_method" "todos" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "ANY"
      + id               = (known after apply)
      + region           = "sa-east-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method_response.cors will be created
  + resource "aws_api_gateway_method_response" "cors" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "sa-east-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Credentials" = true
          + "method.response.header.Access-Control-Allow-Headers"     = false
          + "method.response.header.Access-Control-Allow-Methods"     = false
          + "method.response.header.Access-Control-Allow-Origin"      = false
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # aws_api_gateway_method_response.cors_todo will be created
  + resource "aws_api_gateway_method_response" "cors_todo" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "sa-east-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Credentials" = true
          + "method.response.header.Access-Control-Allow-Headers"     = false
          + "method.response.header.Access-Control-Allow-Methods"     = false
          + "method.response.header.Access-Control-Allow-Origin"      = false
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # aws_api_gateway_resource.todo will be created
  + resource "aws_api_gateway_resource" "todo" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{todoId}"
      + region      = "sa-east-1"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.todos will be created
  + resource "aws_api_gateway_resource" "todos" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "todos"
      + region      = "sa-east-1"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.v1 will be created
  + resource "aws_api_gateway_resource" "v1" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "v1"
      + region      = "sa-east-1"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.this will be created
  + resource "aws_api_gateway_rest_api" "this" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "tf-serverless-prod"
      + policy                       = (known after apply)
      + region                       = "sa-east-1"
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.this will be created
  + resource "aws_api_gateway_stage" "this" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + region        = "sa-east-1"
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags_all      = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + web_acl_arn   = (known after apply)
    }

  # aws_cognito_user_pool.this will be created
  + resource "aws_cognito_user_pool" "this" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "tf-serverless-prod"
      + region                     = "sa-east-1"
      + sms_verification_message   = (known after apply)
      + tags_all                   = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = false
        }

      + email_configuration {
          + email_sending_account = "COGNITO_DEFAULT"
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "email"
          + required                 = true

          + string_attribute_constraints {
              + max_length = "2048"
              + min_length = "0"
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + user_attribute_update_settings {
          + attributes_require_verification_before_update = [
              + "email",
            ]
        }

      + username_configuration {
          + case_sensitive = false
        }

      + verification_message_template {
          + default_email_option  = "CONFIRM_WITH_CODE"
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # aws_cognito_user_pool_client.this will be created
  + resource "aws_cognito_user_pool_client" "this" {
      + access_token_validity                         = 60
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "phone",
        ]
      + auth_session_validity                         = 3
      + callback_urls                                 = [
          + "http://localhost:5173",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = false
      + enable_token_revocation                       = true
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = 60
      + logout_urls                                   = []
      + name                                          = "react-client-prod"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = [
          + "address",
          + "birthdate",
          + "email",
          + "email_verified",
          + "family_name",
          + "gender",
          + "given_name",
          + "locale",
          + "middle_name",
          + "name",
          + "nickname",
          + "phone_number",
          + "phone_number_verified",
          + "picture",
          + "preferred_username",
          + "profile",
          + "updated_at",
          + "website",
          + "zoneinfo",
        ]
      + refresh_token_validity                        = 30
      + region                                        = "sa-east-1"
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = [
          + "address",
          + "birthdate",
          + "email",
          + "family_name",
          + "gender",
          + "given_name",
          + "locale",
          + "middle_name",
          + "name",
          + "nickname",
          + "phone_number",
          + "picture",
          + "preferred_username",
          + "profile",
          + "updated_at",
          + "website",
          + "zoneinfo",
        ]

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "days"
        }
    }

  # aws_cognito_user_pool_domain.this will be created
  + resource "aws_cognito_user_pool_domain" "this" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "api-tf-serverless-prod"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + region                          = "sa-east-1"
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = (known after apply)
      + version                         = (known after apply)
    }

  # aws_dynamodb_table.this will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "TodoId"
      + id               = (known after apply)
      + name             = "tf-serverless-prod"
      + range_key        = "UserId"
      + read_capacity    = (known after apply)
      + region           = "sa-east-1"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "Done"
          + type = "S"
        }
      + attribute {
          + name = "TodoId"
          + type = "S"
        }
      + attribute {
          + name = "UserId"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "UserId"
          + name               = "TodosByUser"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "Done"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # aws_lambda_permission.apigw will be created
  + resource "aws_lambda_permission" "apigw" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tf-serverless-prod-dynamodb"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "sa-east-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.lambda_artefacts will be created
  + resource "aws_s3_bucket" "lambda_artefacts" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "968339500772-tf-serverless-lambda-artefacts"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "sa-east-1"
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_object.lambda_artefact will be created
  + resource "aws_s3_object" "lambda_artefact" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/zip"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + region                 = "sa-east-1"
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + version_id             = (known after apply)
    }

  # random_uuid.build_id will be created
  + resource "random_uuid" "build_id" {
      + id      = (known after apply)
      + keepers = {
          + "code_hash" = "70c21b8484dab0bd8ae02568718bedecb1de5628"
        }
      + result  = (known after apply)
    }

  # terraform_data.build will be created
  + resource "terraform_data" "build" {
      + id               = (known after apply)
      + triggers_replace = {
          + code_hash = "70c21b8484dab0bd8ae02568718bedecb1de5628"
        }
    }

  # module.iam_role_dynamodb_lambda.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "tf-serverless-prod-dynamodb-lambda-execute-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:sa-east-1:968339500772:table/tf-serverless-prod/index/*",
                          + "arn:aws:dynamodb:sa-east-1:968339500772:table/tf-serverless-prod",
                        ]
                      + Sid      = "AllowDynamoDBActions"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "AllowCreatingLogGroups"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/lambda/*:*"
                      + Sid      = "AllowWritingLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
    }

  # module.iam_role_dynamodb_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tf-serverless-prod-dynamodb-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam_role_dynamodb_lambda.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tf-serverless-prod-dynamodb-lambda-role"
    }

  # module.lambda_dynamodb.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/tf-serverless-prod-dynamodb"
      + name_prefix       = (known after apply)
      + region            = "sa-east-1"
      + retention_in_days = 3
      + skip_destroy      = false
      + tags_all          = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
    }

  # module.lambda_dynamodb.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Triggered by API Gateway to save data into DynamoDB table"
      + function_name                  = "tf-serverless-prod-dynamodb"
      + handler                        = "lambdas/dynamodb.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "sa-east-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "968339500772-tf-serverless-lambda-artefacts"
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CreateAt"  = "2025-09-01"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "TF AWS Serverless"
        }
      + timeout                        = 15
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 35 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_custom_domain_url    = ""
  + cognito_client_id        = (known after apply)
  + cognito_pool_id          = (known after apply)
  + cognito_url              = "https://api-tf-serverless-prod.auth.sa-east-1.amazoncognito.com"
  + lambda_dynamo_invoke_url = (known after apply)

```
</details>